app/controllers/frames_controller.rb

  def index
    #raise "indexing"
    @frames = Frame.all
---
SELECT * FROM "frames"

  def edit
    @session = Session.find(params[:session_id])
    @turn = params[:turn]
    @player = @session.player
    @frame = Frame.find_by_session_id_and_turn(@session.id, @turn) || Frame.new(:session_id => @session.id, :turn => @turn)
---
SELECT * FROM "frames" WHERE ("frames"."turn" = '1' AND "frames"."session_id" = 1) LIMIT 1
SELECT * FROM "players" WHERE ("players"."id" = 1)

  def update
    @session = Session.find(params[:frame][:session_id])
    @turn = params[:frame][:turn]
    @frame = Frame.find_by_session_id_and_turn(@session.id, @turn) || Frame.new(:session_id => @session.id, :turn => @turn)

    respond_to do |format|
      if @frame.update_attributes(params[:frame])
---
SELECT * FROM "frames" WHERE ("frames"."turn" = '5' AND "frames"."session_id" = 1) LIMIT 1
UPDATE "frames" SET "updated_at" = '2011-03-28 17:08:26', "first_frame" = 5, "second_frame" = 4 WHERE "id" = 2