app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM "games"

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)

  def create
    player_attributes = params[:game].delete(:player_attributes)
    @game = Game.new(params[:game])
    player_attributes.each do |pair|
      player = Player.find_or_create_by_name(pair["name"])
      @game.sessions << Session.new(:player => player)
---
INSERT INTO "players" ("name", "created_at", "updated_at") VALUES(NULL, '2011-03-28 14:46:41', '2011-03-28 14:46:41')
SELECT * FROM "players" WHERE ("players"."name" = 'Sarah Lee') LIMIT 1
INSERT INTO "games" ("name", "created_at", "updated_at") VALUES('Joe and Bob''s game', '2011-03-23 20:21:05', '2011-03-23 20:21:05')

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT * FROM "games" WHERE ("games"."id" = 3)
DELETE FROM "games" WHERE "id" = 3